{
  "activation_dropout": 0.1,
  "activation_function": "gelu",
  "add_bias_logits": true,
  "add_final_layer_norm": false,
  "architectures": [
    "PegasusXForConditionalGeneration"
  ],
  "attention_dropout": 0.1,
  "block_size": 512,
  "bos_token_id": 0,
  "classif_dropout": 0.0,
  "classifier_dropout": 0.0,
  "d_model": 768,
  "decoder_attention_heads": 12,
  "decoder_ffn_dim": 3072,
  "decoder_layerdrop": 0.0,
  "decoder_layers": 12,
  "decoder_start_token_id": 0,
  "dropout": 0.1,
  "dtype": "float32",
  "encoder_attention_heads": 12,
  "encoder_ffn_dim": 3072,
  "encoder_layerdrop": 0.0,
  "encoder_layers": 12,
  "eos_token_id": 1,
  "extra_pos_embeddings": 1,
  "force_bos_token_to_be_generated": false,
  "gradient_checkpointing": false,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1",
    "2": "LABEL_2"
  },
  "init_std": 0.02,
  "is_encoder_decoder": true,
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1,
    "LABEL_2": 2
  },
  "max_position_embeddings": 16384,
  "model_type": "pegasus_x",
  "normalize_before": false,
  "normalize_embedding": true,
  "num_global_tokens": 128,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "scale_embedding": true,
  "stagger_local_blocks": true,
  "static_position_embeddings": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "use_cache": false,
  "vocab_size": 96103
}
